 # File Operations Using text files

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [24]:
# reading CSV files

In [3]:
dframe = pd.read_csv("Documents/Jes.csv")

In [4]:
dframe

    Unnamed: 0        date Salesperson  value
0            0  03/01/2000       Allen  12000
1            1  04/01/2000       Allen  15000
2            2  05/01/2000       Allen  25000
3            3  03/01/2000      Mathew   3500
4            4  04/01/2000      Mathew   6500
5            5  05/01/2000      Mathew   7500
6            6  03/01/2000      Clarke   6578
7            7  04/01/2000      Clarke   5467
8            8  05/01/2000      Clarke   7790
9            9  03/01/2000         Don   8900
10          10  04/01/2000         Don   7000
11          11  05/01/2000         Don   6500

In [5]:
dframe1 = pd.read_csv("Documents/JEs.csv", header = None) # if first row is not a header

In [6]:
dframe1

       0           1            2      3
0    NaN        date  Salesperson  value
1    0.0  03/01/2000        Allen  12000
2    1.0  04/01/2000        Allen  15000
3    2.0  05/01/2000        Allen  25000
4    3.0  03/01/2000       Mathew   3500
5    4.0  04/01/2000       Mathew   6500
6    5.0  05/01/2000       Mathew   7500
7    6.0  03/01/2000       Clarke   6578
8    7.0  04/01/2000       Clarke   5467
9    8.0  05/01/2000       Clarke   7790
10   9.0  03/01/2000          Don   8900
11  10.0  04/01/2000          Don   7000
12  11.0  05/01/2000          Don   6500

In [7]:
# reading the csv file as a table

In [8]:
dframe = pd.read_csv("Documents/JEs.csv", sep = ",")
dframe

    Unnamed: 0        date Salesperson  value
0            0  03/01/2000       Allen  12000
1            1  04/01/2000       Allen  15000
2            2  05/01/2000       Allen  25000
3            3  03/01/2000      Mathew   3500
4            4  04/01/2000      Mathew   6500
5            5  05/01/2000      Mathew   7500
6            6  03/01/2000      Clarke   6578
7            7  04/01/2000      Clarke   5467
8            8  05/01/2000      Clarke   7790
9            9  03/01/2000         Don   8900
10          10  04/01/2000         Don   7000
11          11  05/01/2000         Don   6500

In [9]:
dframe = pd.read_csv("Documents/Jes.csv", nrows = 2)
dframe

   Unnamed: 0        date Salesperson  value
0           0  03/01/2000       Allen  12000
1           1  04/01/2000       Allen  15000

In [10]:
# Writing to CSV files

In [11]:
dframe

   Unnamed: 0        date Salesperson  value
0           0  03/01/2000       Allen  12000
1           1  04/01/2000       Allen  15000

In [12]:
dframe.to_csv("sample_out.csv")

In [14]:
dframe = pd.read_csv("Documents/JEs.csv", nrows = 3)
dframe
# dframe.to_csv("sample_out2.csv")

   Unnamed: 0        date Salesperson  value
0           0  03/01/2000       Allen  12000
1           1  04/01/2000       Allen  15000
2           2  05/01/2000       Allen  25000

In [15]:
# Displaying data directly on the screen

In [16]:
import sys

In [17]:
dframe.to_csv(sys.stdout)

,Unnamed: 0,date,Salesperson,value
0,0,03/01/2000,Allen,12000
1,1,04/01/2000,Allen,15000
2,2,05/01/2000,Allen,25000

In [18]:
dframe.to_csv(sys.stdout, sep = "_")

_Unnamed: 0_date_Salesperson_value
0_0_03/01/2000_Allen_12000
1_1_04/01/2000_Allen_15000
2_2_05/01/2000_Allen_25000

In [19]:
# Retrieving the column values

In [21]:
dframe.to_csv(sys.stdout, columns=["Salesperson", "value"])

,Salesperson,value
0,Allen,12000
1,Allen,15000
2,Allen,25000

# Python and Excel files

In [25]:
#in anaconda prompt:
#pip install xlrd
#pip install openpyxl

In [26]:
xlsfile = pd.ExcelFile("Documents/Test.xlsx")

In [27]:
xlsfile

In [28]:
dframe = xlsfile.parse("Sheet1")

In [29]:
dframe

   Sample  Unnamed: 1  Unnamed: 2
0      45          33          87
1      34          44          76
2      67          55          54
3      78          66          43
4      89          77          32

In [30]:
# Rename the columns

In [31]:
dframe.columns = ["sample", "Value1", "Value2"]
dframe

   sample  Value1  Value2
0      45      33      87
1      34      44      76
2      67      55      54
3      78      66      43
4      89      77      32

In [32]:
# checking the existence of an item or value

In [36]:
Value = [55]
dframe.Value1.isin(Value) # isin() takes list objects

0    False
1    False
2     True
3    False
4    False
Name: Value1, dtype: bool

In [37]:
dframe.isin(Value)

   sample  Value1  Value2
0   False   False   False
1   False   False   False
2   False    True   False
3   False   False   False
4   False   False   False

In [39]:
dframe["sample"].value_counts()

78    1
45    1
67    1
34    1
89    1
Name: sample, dtype: int64

In [40]:
# Exercise

In [43]:
weather_data_file = pd.ExcelFile("Documents/Weather_data.xlsx")
dframe = weather_data_file.parse("Weather_data")
dframe

          Day          City  Temperature  Wind speed
0  2019-01-01       Newyork           32           6
1  2019-01-02    New Jersey           36           7
2  2019-01-03        Newalk           28          12
3  2019-01-04     NewMalden           33           7
4  2019-01-01        Sydney           90           5
5  2019-01-02       Seattle           85          12
6  2019-01-03  Sierra Leone           87          15
7  2019-01-04         Surat           92           5
8  2019-01-01         Paris           45          20
9  2019-01-02         Patak           50          13
10 2019-01-03         Patna           54           8
11 2019-01-04          Pune           42          10

In [45]:
dframe.isin(["Newyork"])

      Day   City  Temperature  Wind speed
0   False   True        False       False
1   False  False        False       False
2   False  False        False       False
3   False  False        False       False
4   False  False        False       False
5   False  False        False       False
6   False  False        False       False
7   False  False        False       False
8   False  False        False       False
9   False  False        False       False
10  False  False        False       False
11  False  False        False       False

In [46]:
dframe["City"].isin(["Newyork"])

0      True
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
Name: City, dtype: bool